app/Http/Controllers/Auth/RegisteredUserController.php

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('teste', 'tiago.murtinho00@gmail.com', '$2y$12$0hVNBchMqj1cgFDodIB9mOx.4LbBuGF4mzbfSsj4E5FkIZxXVnLHO', '2024-09-05 13:26:57', '2024-09-05 13:26:57')
---
    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:'.User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
            'photo' => ['required', 'image', 'mimes:jpeg,png,jpg,gif|max:2048'],
        ]);

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);