app/Http/View/Composers/RegionComposer.php

select * from `districts` where `districts`.`regions_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9)
select * from `regions`
---
    public function compose(View $view): void
    {
        $regions = Region::with('districts')->get();