app/Http/Controllers/DistrictController.php

    public function show(string $id): \Illuminate\Contracts\View\Factory|\Illuminate\Contracts\View\View|\Illuminate\Foundation\Application
    {
        $districts = District::with('region')->findOrFail($id);
        $cascades = Local::where('districts_id', $id)->where('type', 'cascade')->get();
        $fluvials = Local::where('districts_id', $id)->where('type', 'fluvial')->get();
        $beaches = Local::where('districts_id', $id)->where('type', 'beach')->get();
---
select * from `districts` where `districts`.`id` = '3' limit 1
select * from `regions` where `regions`.`id` in (1)
select * from `locals` where `districts_id` = '3' and `type` = 'cascade'
select * from `locals` where `districts_id` = '3' and `type` = 'fluvial'
select * from `locals` where `districts_id` = '3' and `type` = 'beach'