app/Http/Controllers/HomeController.php

    public function index(): \Illuminate\Contracts\View\Factory|\Illuminate\Contracts\View\View|\Illuminate\Foundation\Application
    {
        // Obtém todos os locais e filtra por tipo e atributo
        $blueFlag = Local::where('type', 'beach')
            ->whereHas('attributes', function($query) {
                $query->where('attributes.id', 6);
            })->get();

        $zeroPollution = Local::where('type', 'beach')
            ->whereHas('attributes', function($query) {
                $query->where('attributes.id', 9);
            })->get();

        $fluvials = Local::where('type', 'fluvial')->get();
        $cascades = Local::where('type', 'cascade')->get();
---
select * from `locals` where `type` = 'fluvial'
select * from `locals` where `type` = 'cascade'