app/Http/Controllers/LocalController.php

    public function show(string $id): \Illuminate\Contracts\View\Factory|\Illuminate\Contracts\View\View|\Illuminate\Foundation\Application
    {

        $local = Local::with('district', 'attributes')->findOrFail($id);
---
select * from `districts` where `districts`.`id` in (3)
select * from `locals` where `locals`.`id` = '7' limit 1