app/Http/Controllers/ProfileController.php

select * from `users` where `users`.`id` = '23' limit 1
---
    public function index($id)
    {
        $user = User::findOrFail($id);

select * from `users` where `users`.`id` = '28' limit 1
delete from `users` where `id` = 28
---
    public function destroy(Request $request, $id)
    {
        $user = User::findOrFail($id); // Encontre o usuário pelo ID

        // Validação
        $request->validate([
            'password' => 'required',
        ]);

        // Verificação da senha
        if (!Hash::check($request->password, $user->password)) {
            return response()->json([
                'success' => false,
                'message' => 'Senha incorreta. A conta não foi apagada.'
            ], 400); // 400 Bad Request
        }

        // Logout e exclusão do usuário
        Auth::logout();
        $user->delete();