app/Http/Controllers/RegionController.php

select * from `locals` where `locals`.`districts_id` in (3, 4, 10, 16, 18, 19)
select * from `regions` where `regions`.`id` = '1' limit 1
select distinct * from `locals` where `regions_id` = '1' and `name` LIKE '%%'
---
    public function show(Request $request, $id): \Illuminate\Contracts\View\Factory|\Illuminate\Contracts\View\View|\Illuminate\Foundation\Application
    {
        $region = Region::with('districts.locals')->findOrFail($id);

        $filters = $request->input('filters', []); // Obtém os filtros do request
        $query = $request->input('query', ''); // O termo de pesquisa

        // Aplicar filtros se houver
        $localsQuery = Local::query()
            ->where('regions_id', $id)
            ->where('name', 'LIKE', '%' . $query . '%');

        if (!empty($filters)) {
            $localsQuery->whereHas('attributes', function ($query) use ($filters) {
                $query->whereIn('name', $filters);
            }, '=', count($filters));
        }

        $locals = $localsQuery->distinct()->get();