app/Http/Controllers/SearchController.php

select * from `locals` where `name` LIKE '%praia%'
---
    public function autocomplete(Request $request): JsonResponse
    {
        $search = $request->get('query');
        $locals = Local::where('name', 'LIKE', "%$search%")->get();

select distinct * from `locals` where `name` LIKE '%%' and (select count(*) from `attributes` inner join `locals_has_attributes` on `attributes`.`id` = `locals_has_attributes`.`attributes_id` where `locals`.`id` = `locals_has_attributes`.`locals_id` and `name` in ('Bandeira Azul')) = 1 and `districts_id` = '8'
---
    public function filterResults(Request $request): Factory|View|Application
    {
        $regionId = $request->route('regionId');
        $districtId = $request->route('districtId');

        $query = $request->input('query', '');
        $filters = $request->input('filters', []);

        Log::info('Region ID: ' . $regionId);
        Log::info('District ID: ' . $districtId);
        Log::info('Query: ' . $query);
        Log::info('Filters: ', $filters);

        $localsQuery = Local::query()
            ->where('name', 'LIKE', '%' . $query . '%');

        if (!empty($filters)) {
            $localsQuery->whereHas('attributes', function ($query) use ($filters) {
                $query->whereIn('name', $filters);
            }, '=', count($filters));
        }

        if ($districtId) {
            $localsQuery->where('districts_id', $districtId);
        } elseif ($regionId) {
            $localsQuery->where('regions_id', $regionId);
        }

        $locals = $localsQuery->distinct()->get();